Rolecall_To_Fusion/Rolecall_To_Fusion/Files/RoleCall_FU/Fusion/Customer/CreateBUAssignment/Request/CreateBUAssignment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/financials/receivables/customers/customerProfileService/types/" xmlns:cus="http://xmlns.oracle.com/apps/financials/receivables/customers/customerProfileService/">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:createReferenceAccountsForBillToSite>
         <typ:referenceAccounts>
			<cus:RequestId>123456789874561</cus:RequestId>
            <!--Optional:-->
            <cus:CustomerNumber>Test1</cus:CustomerNumber>
            <!--Optional:-->
            <cus:CustomerAccountNumber>TestAccount</cus:CustomerAccountNumber>
            <!--Optional:-->
            <cus:CustomerSiteNumber>Test1</cus:CustomerSiteNumber>
            <!--Optional:-->
            <cus:BusinessUnit>Dusters Total Solutions Services Pvt. Ltd.</cus:BusinessUnit>
            <!--Optional:-->
            <cus:RevenueAccountCodeCombination>100.999.4321201.999.030.0006.99999.99999.999.999.9999</cus:RevenueAccountCodeCombination>
            <!--Optional:-->
            <cus:ReceivableAccountCodeCombination>100.999.4321201.999.030.0006.99999.99999.999.999.9999</cus:ReceivableAccountCodeCombination>            
         </typ:referenceAccounts>
      </typ:createReferenceAccountsForBillToSite>
   </soapenv:Body>
</soapenv:Envelope>
